import os
from pathlib import Path
import pandas as pd
import pywikibot
#import argparse
# from gooey import Gooey
# from gooey import GooeyParser


DIR = r'D:\script\MohibPython\DATA'
excelFile = os.path.join(DIR, 'WomenPolitician.xlsx')
outfile = os.path.join(DIR, 'OF_Politician.txt')

nl = '\n'
ref = f'''
        {nl} == حوالہ جات ==
        {nl}{{حوالہ جات|30em}}
'''


def addRef():
    p = '|'
    startRef = '<ref>{{cite web'
    endRef = '}} </ref>'


def politicalContent(pLine, title, pparty, prov, eYR):
    if eYR == 'غیر موجود':
        pLine1 = pLine
    else:
        pLine1 = pLine + title + \
            str(eYR) + "  کے عام انتخابات میں خواتین کے لیے مخصوص نشست پر"
        pLine1 += pparty + " کی امیدوار کے طور پر " + \
            prov + "کی صوبائی اسمبلی کے لئے منتخب ہو گئیں۔"

    return pLine1


def categorize(nl, prov, party):
    if prov == 'پنجاب':
        if party == 'مسلم لیگ (نواز گروپ)':
            cat_pnb_pmln = f'''
            {nl}[[زمرہ:خواتین اراکین پنجاب صوبائی اسمبلی]]
            {nl}[[زمرہ:پنجاب کے سیاست دان]]
            {nl}[[زمرہ:پاکستان مسلم لیگ کے اراکین پنجاب صوبائی اسمبلی]]
            {nl}[[زمرہ:بقید حیات شخصیات]]
            {nl}[[زمرہ:پاکستان مسلم لیگ کی خواتین سیاستدان]]
            {nl}[[زمرہ:پاکستان مسلم لیگ کی مخصوص نشستوں پر خواتین سیاستدان]]
            {nl}[[زمرہ:پاکستان مسلم لیگ کے پنجابی سیاستدان]]
            {nl}[[زمرہ:انتخابات 2018 میں پاکستان مسلم لیگ کے اراکین صوبائی اسمبلی]]
            {nl}[[زمرہ:اراکین پنجاب صوبائی اسمبلی]]
            {nl}[[زمرہ:اعلی تعلیم یافتہ صوبائی اسمبلی اراکین]]
            '''
            return cat_pnb_pmln
        else:
            cat_pnb_pti = f'''
            {nl}[[زمرہ:خواتین اراکین پنجاب صوبائی اسمبلی]]
            {nl}[[زمرہ:پنجاب کے سیاست دان]]
            {nl}[[زمرہ:پاکستان تحریک انصاف کے ارکان صوبائی اسمبلی (پنجاب)]]
            {nl}[[زمرہ:بقید حیات شخصیات]]
            {nl}[[زمرہ:پاکستان تحریک انصاف کی خواتین سیاستدان]]
            {nl}[[زمرہ:پاکستان تحریک انصاف کی مخصوص نشستوں پر خواتین سیاستدان]]
            {nl}[[زمرہ:پاکستان تحریک انصاف کے پنجابی سیاستدان]]
            {nl}[[زمرہ:انتخابات 2018 میں پاکستان تحریک انصاف کے اراکین صوبائی اسمبلی]]
            {nl}[[زمرہ:اراکین پنجاب صوبائی اسمبلی]]
            {nl}[[زمرہ:اعلی تعلیم یافتہ صوبائی اسمبلی اراکین]]
            {nl}[[زمرہ:غیر موجود سال پیدائش (بقید حیات شخصیات)]]
            '''
            return cat_pnb_pti

    elif prov == 'سندھ':
        if party == 'متحدہ قومی موومنٹ':
            cat_snd_mqm = f'''
            {nl}[[زمرہ:خواتین اراکین سندھ صوبائی اسمبلی]]
            {nl}[[زمرہ:سندھ کے سیاست دان]]
            {nl}[[زمرہ:متحدہ قومی موومنٹ کے اراکین پنجاب صوبائی اسمبلی]]
            {nl}[[زمرہ:بقید حیات شخصیات]]
            {nl}[[زمرہ:متحدہ قومی موومنٹ کی خواتین سیاستدان]]
            {nl}[[زمرہ:متحدہ قومی موومنٹ کی مخصوص نشستوں پر خواتین سیاستدان]]
            {nl}[[زمرہ:متحدہ قومی موومنٹ کے سندھ سیاستدان]]
            {nl}[[زمرہ:انتخابات 2018 میں متحدہ قومی موومنٹ کے اراکین صوبائی اسمبلی]]
            {nl}[[زمرہ:اراکین سندھ صوبائی اسمبلی]]
            {nl}[[زمرہ:اعلی تعلیم یافتہ صوبائی اسمبلی اراکین]]
            {nl}[[زمرہ:غیر موجود سال پیدائش (بقید حیات شخصیات)]]
            '''
            return cat_snd_mqm
        elif party == 'پاکستان تحریک انصاف':
            cat_snd_pti = f'''
            {nl}[[زمرہ:خواتین اراکین سندھ صوبائی اسمبلی]]
            {nl}[[زمرہ:سندھ کے سیاست دان]]
            {nl}[[زمرہ:پاکستان تحریک انصاف کے اراکین پنجاب صوبائی اسمبلی]]
            {nl}[[زمرہ:بقید حیات شخصیات]]
            {nl}[[زمرہ:پاکستان تحریک انصاف کی خواتین سیاستدان]]
            {nl}[[زمرہ:پاکستان تحریک انصاف کی مخصوص نشستوں پر خواتین سیاستدان]]
            {nl}[[زمرہ:پاکستان تحریک انصاف کے سندھ سیاستدان]]
            {nl}[[زمرہ:انتخابات 2018 میں پاکستان تحریک انصاف کے اراکین صوبائی اسمبلی]]
            {nl}[[زمرہ:اراکین سندھ صوبائی اسمبلی]]
            {nl}[[زمرہ:اعلی تعلیم یافتہ صوبائی اسمبلی اراکین]]
            {nl}[[زمرہ:غیر موجود سال پیدائش (بقید حیات شخصیات)]]
            '''
            return cat_snd_pti
    elif prov == 'خیبرپختونخوا':
        if party == 'پاکستان تحریک انصاف':
            cat_kpk_pti = f'''
            {nl}[[زمرہ:خواتین اراکین خیبر پختونخوا صوبائی اسمبلی]]
            {nl}[[زمرہ:خیبر پختونخوا کے سیاست دان]]
            {nl}[[زمرہ:پاکستان تحریک انصاف کے ارکان صوبائی اسمبلی خیبر پختونخوا]]
            {nl}[[زمرہ:بقید حیات شخصیات]]
            {nl}[[زمرہ:پاکستان تحریک انصاف کی خواتین سیاستدان]]
            {nl}[[زمرہ:پاکستان تحریک انصاف کی مخصوص نشستوں پر خواتین سیاستدان]]
            {nl}[[زمرہ:پاکستان تحریک انصاف کے پشتون سیاستدان]]
            {nl}[[زمرہ:پاکستان تحریک انصاف کے 2018  کے انتخابات میں صوبائی اسمبلی اراکین]]
            {nl}[[زمرہ:ارکان صوبائی اسمبلی خیبر پختونخوا]]
            {nl}[[زمرہ:اعلی تعلیم یافتہ صوبائی اسمبلی اراکین]]
            {nl}[[زمرہ:غیر موجود سال پیدائش (بقید حیات شخصیات)]]
            '''
            return cat_kpk_pti
        elif party == 'عوامی نیشنل پارٹی':
            cat_kpk_anp = f'''
            {nl}[[زمرہ:خواتین اراکین خیبر پختونخوا صوبائی اسمبلی]]
            {nl}[[زمرہ:خیبر پختونخوا کے سیاست دان]]
            {nl}[[زمرہ: عوامی نیشنل پارٹی کے ارکان صوبائی اسمبلی خیبر پختونخوا]]
            {nl}[[زمرہ:بقید حیات شخصیات]]
            {nl}[[زمرہ:عوامی نیشنل پارٹی کی خواتین سیاستدان]]
            {nl}[[زمرہ:عوامی نیشنل پارٹی  کی مخصوص نشستوں پر خواتین سیاستدان]]
            {nl}[[زمرہ:عوامی نیشنل پارٹی  کے پشتون سیاستدان]]
            {nl}[[زمرہ:عوامی نیشنل پارٹی  کے 2018  کے انتخابات میں صوبائی اسمبلی اراکین]]
            {nl}[[زمرہ:ارکان صوبائی اسمبلی خیبر پختونخوا]]
            {nl}[[زمرہ:اعلی تعلیم یافتہ صوبائی اسمبلی اراکین]]
            {nl}[[زمرہ:غیر موجود سال پیدائش (بقید حیات شخصیات)]]
            '''
            return cat_kpk_anp
    elif prov == 'بلوچستان':
        if party == 'پاکستان تحریک انصاف':
            cat_blch_pti = f'''
            {nl}[[زمرہ:خواتین اراکین پنجاب صوبائی اسمبلی]]
            {nl}[[زمرہ:بلوچستان کے سیاست دان]]
            {nl}[[زمرہ:پاکستان تحریک انصاف کے ارکان صوبائی اسمبلی (بلوچستان)]]
            {nl}[[زمرہ:بقید حیات شخصیات]]
            {nl}[[زمرہ:پاکستان تحریک انصاف کی خواتین سیاستدان]]
            {nl}[[زمرہ:پاکستان تحریک انصاف کی مخصوص نشستوں پر خواتین سیاستدان]]
            {nl}[[زمرہ:پاکستان تحریک انصاف کے بلوچی سیاستدان]]
            {nl}[[زمرہ:انتخابات 2018 میں پاکستان تحریک انصاف کے اراکین صوبائی اسمبلی]]
            {nl}[[زمرہ:اراکین بلوچستان صوبائی اسمبلی]]
            {nl}[[زمرہ:اعلی تعلیم یافتہ صوبائی اسمبلی اراکین]]
            {nl}[[زمرہ:غیر موجود سال پیدائش (بقید حیات شخصیات)]]
            '''
            return cat_blch_pti


def write_output(text):
    with open(outfile, 'a', encoding='utf-8') as ofile:
        ofile.write(text)


def createArticle(row):
    btag = "'''"
    start = "{{-start -}}"
    stop = "{{-stop-}}"
    title = row['Title']
    bTitle = btag + title + btag
    pparty = row['Party']
    prov = row['Province']
    eYR1 = row['EYR1']
    eYR2 = row['EYR2']
    eYR3 = row['EYR3']

    with open(outfile, 'a', encoding='utf-8') as ofile:
        ofile.write(f'{start}\n')
        ofile.write(f'{bTitle}')
        line1 = f" ایک پاکستانی سیاستدان ہیں، جن کی سیاسی وابستگی "
        line1 = title + line1 + pparty + " سے ہے۔"
        ofile.write(f'\n{line1}')

        line2 = title + " سن " + str(eYR3) + " سے "
        line2 += prov + " کی صوبائی اسمبلی  کی رکن رہی ہیں۔"
        ofile.write(f'\n{line2}')

        politicHead = nl + "== سیاسی کیریئر =="
        ofile.write(f'\n{politicHead}')

        pLine = ""
        pLine1 = politicalContent(pLine, title, pparty, prov, eYR1)
        pLine2 = politicalContent(pLine1, title, pparty, prov, eYR2)
        pLine3 = politicalContent(pLine2, title, pparty, prov, eYR3)
        ofile.write(f'\n{pLine3}')

        standComm = "=== قائمہ کمیٹیوں کی رکنیت ==="
        ofile.write(f'\n{standComm}')
        Performance = title + "متحرک اور سرگرم عمل صوبائی اسمبلی رکن ہیں جو قائمہ کمیٹیوں ، توجہ دلاؤ نوٹس اور اسمبلی کی قراردادوں میں شریک رہیں۔"
        ofile.write(f'\n{Performance}')

        ofile.write(f'\n{ref}')

        cats = categorize(nl, prov, party)
        ofile.write(f'\n{cats}')

        ofile.write(f'\n{stop}')

        #line2 = f"{row['Title']} سن {row['ElectYr']} سے سیاسی جماعت {row['Party']} سے جڑی {row['Province']} کی صوبائی اسمبلی کی رکن رہی ہیں۔"
        #text = bTitle + nl + line1 + nl + line2 + nl + nl
        #finalText = start + text + stop
        # write_output(finalText)


data = pd.read_excel(excelFile)
df = pd.DataFrame(
    data, columns=['Num', 'Title', 'DateOath', 'Party', 'DateBirth', 'EYR1', 'EYR2', 'EYR3', 'EduYr', 'EduMajor', 'Province'])

for idx, datarow in df.iterrows():
    createArticle(datarow)


# write_output(wikitext)


# if __name__ == "__main__":
#     main()
